//#;*****************************************************************************
//#;
//#; Copyright (C) 2017-2023 Advanced Micro Devices, Inc. All rights reserved.
//#;
//#;******************************************************************************
/=#
#langdef en-US "English"

#string STR_AMD_PBS_SETUP_TITLE             #language en-US "AMD PBS"
#string STR_AMD_PBS_SETUP_TITLE_HELP        #language en-US "AMD PBS Setup Page"

#string STR_AMD_PBS_SETUP_FORM_TITLE        #language en-US "AMD PBS Option"
#string STR_AMD_PBS_ROOT_SECTION_TEXT       #language en-US "AMD PBS"

#string STR_BLANK_STRING                    #language en-US " "
#string STR_USER_MANUAL_TEXT                #language en-US "Manual"

#string STR_ENABLED_TEXT                    #language en-US "Enabled "
#string STR_DISABLED_TEXT                   #language en-US "Disabled"
#string STR_AUTO_TEXT                       #language en-US "Auto"
#string STR_NONE_TEXT                       #language en-US "None"
#string STR_YES_TEXT                        #language en-US "Yes"
#string STR_NO_TEXT                         #language en-US "No"
#string STR_POLLED_TEXT                     #language en-US "Polled"
#string STR_NMI_SCI_TEXT                    #language en-US "NMI/ SCI"
#string STR_NMI_TEXT                        #language en-US "NMI"
#string STR_SCI_TEXT                        #language en-US "SCI"

//AMD CPM RAS
#string STR_RAS_FORM                        #language en-US "RAS"
#string STR_RAS_FORM_HELP                   #language en-US "AMD CPM RAS related settings"
#string STR_THRESHOLD_PERIODIC_SMI_EN       #language en-US "RAS Periodic SMI Control"
#string STR_THRESHOLD_PERIODIC_SMI_EN_HELP  #language en-US "Enable/ disable Periodic SMI for polling [MCA Threshold] error"
#string STR_SMI_THRESHOLD                   #language en-US "SMI Threshold"
#string STR_SMI_THRESHOLD_HELP              #language en-US "The [SMI Threshold] limits the number of [MCA Threshold and Deferred Error SMI source] per a Unit time (Defined by [SMI Scale]). (Default: 5 dec interrupts)"
#string STR_SMI_SCALE                       #language en-US "SMI Scale"
#string STR_SMI_SCALE_HELP                  #language en-US "The [SMI Scale] defines the time scale. (Default: 1000 dec)"
#string STR_SMI_SCALE_UNIT                  #language en-US "SMI Scale Unit"
#string STR_SMI_SCALE_UNIT_HELP             #language en-US "The [SMI Scale Unit] defines the unit of time scale. (Default: ms)"
#string STR_SMI_SCALE_UNIT_MS               #language en-US "millisecond"
#string STR_SMI_SCALE_UNIT_SEC              #language en-US "second"
#string STR_SMI_SCALE_UNIT_MIN              #language en-US "minute"
#string STR_SMI_PERIOD                      #language en-US "SMI Period"
#string STR_SMI_PERIOD_HELP                 #language en-US "The [SMI Period] defines the polling interval (Default: 1000 dec, Maximum: 32767 dec, 0: Disable, Unit: ms)"

#string STR_GHES_NOTIFY_TYPE                #language en-US "GHES Notify Type"
#string STR_GHES_NOTIFY_TYPE_HELP           #language en-US "Notification type for deferred/corrected errors"
#string STR_PCIE_GHES_NOTIFY_TYPE           #language en-US "PCIe GHES Notify Type"
#string STR_PCIE_GHES_NOTIFY_TYPE_HELP      #language en-US "Notification type for PCIe corrected errors"
#string STR_PCIE_RP_CORR_ERR_MASK           #language en-US "PCIe Root Port Corr Err Mask Reg"
#string STR_PCIE_RP_CORR_ERR_MASK_HELP      #language en-US "Initialize the PCIe AER Corrected Error Mask register of Root Port"
#string STR_PCIE_RP_UNCORR_ERR_MASK         #language en-US "PCIe Root Port UnCorr Err Mask Reg"
#string STR_PCIE_RP_UNCORR_ERR_MASK_HELP    #language en-US "Initialize the PCIe AER Uncorrected Error Mask register of Root Port"
#string STR_PCIE_RP_UNCORR_ERR_SEV          #language en-US "Pcie Root Port UnCorr Error Sev Reg"
#string STR_PCIE_RP_UNCORR_ERR_SEV_HELP     #language en-US "Initialize the PCIe AER Uncorrected Error Severity registers of Root Port"
#string STR_PCIE_DEV_CORR_ERR_MASK          #language en-US "PCIe Device Corr Err Mask Reg"
#string STR_PCIE_DEV_CORR_ERR_MASK_HELP     #language en-US "Initialize the PCIe AER Corrected Error Mask register of PCIe Device"
#string STR_PCIE_DEV_UNCORR_ERR_MASK        #language en-US "PCIe Device UnCorr Err Mask Reg"
#string STR_PCIE_DEV_UNCORR_ERR_MASK_HELP   #language en-US "Initialize the PCIe AER Uncorrected Error Mask register of PCIe Device"
#string STR_PCIE_DEV_UNCORR_ERR_SEV         #language en-US "Pcie Device UnCorr Error Sev Reg"
#string STR_PCIE_DEV_UNCORR_ERR_SEV_HELP    #language en-US "Initialize the PCIe AER Uncorrected Error Severity registers of PCIe Device"
#string STR_CXL_DP_CIE_MASK_ENABLE          #language en-US "CXL DP CIE Mask Enable"
#string STR_CXL_DP_CIE_MASK_ENABLE_HELP     #language en-US "Enable/Disable masking of CXL DP Correctable Error - Internal Error"

#string STR_HARD_PPR_ENABLE                       #language en-US "DRAM Hard Post Package Repair"
#string STR_HARD_PPR_ENABLE_HELP                  #language en-US "This feature allows spare DRAM rows to replace malfunctioning rows via an in-field repair mechanism"

#string STR_GHES_UNCORR_ERR_NOTIFY_TYPE           #language en-US "GHES UnCorr Notify Type"
#string STR_GHES_UNCORR_ERR_NOTIFY_TYPE_HELP      #language en-US "Notification type for uncorrected errors"
#string STR_PCIE_UNCORR_GHES_NOTIFY_TYPE          #language en-US "PCIe UnCorr GHES Notify Type"
#string STR_PCIE_UNCORR_GHES_NOTIFY_TYPE_HELP     #language en-US "Notification type for PCIe uncorrected errors"
#string STR_HEST_DMC_STRUC_ENABLE                 #language en-US "HEST DMC Structure Support"
#string STR_HEST_DMC_STRUC_ENABLE_HELP            #language en-US "HEST DMC(Deferred Machine Check) Structure Support"

#string STR_CXL_ERROR_REPORT                      #language en-US "CXL Error Report Support"
#string STR_CXL_ERROR_REPORT_HELP                 #language en-US "Enable/ disable CXL Error Reporting"

#string STR_AMD_PBS_ILA_TRACEMEM_EN_PROMPT                #language en-US "iLA TraceMemoryEn"
#string STR_AMD_PBS_ILA_TRACEMEM_EN_HELP                  #language en-US "Reserved 1M bytes MMIO space on 1M boundary when iLA TraceMemoryEn enabled"
#string STR_AMD_PBS_ILA_TRACEMEM_EN_MMIO_ADDR_STRING      #language en-US "iLA TraceMemoryEn reserved MMIO"
#string STR_AMD_PBS_ILA_TRACEMEM_EN_MMIO_ADDR_VALUE       #language en-US "0"

#string STR_RAS_EINJ_MODE                                 #language en-US "RAS EINJ Mode"
#string STR_RAS_EINJ_MODE_HELP                            #language en-US "BIOS: Send APEI EINJ actions to PSP via CPM EINJ SMI callback; PSP: Send APEI EINJ actions to PSP via PSP Mailbox"
#string STR_BIOS_TEXT                                     #language en-US "BIOS"
#string STR_PSP_TEXT                                      #language en-US "PSP"

#string STR_SRIS_MODE_DEBUG                               #language en-US "SRIS mode debug"
#string STR_SRIS_MODE_DEBUG_HELP                          #language en-US "Control SRIS mode debug"
#string STR_SRIS_SKIP_INTERVAL                            #language en-US "Skip interval"
#string STR_SRIS_SKIP_INTERVAL_VAL0                       #language en-US "1506; 144; 6050; 640"
#string STR_SRIS_SKIP_INTERVAL_VAL1                       #language en-US "1538; 154; 6068; 656"
#string STR_SRIS_SKIP_INTERVAL_VAL2                       #language en-US "1358; 128; 6032; 624"
#string STR_SRIS_SKIP_INTERVAL_VAL3                       #language en-US "1180; 112; 5996; 608"
#string STR_SRIS_SKIP_INTERVAL_HELP                       #language en-US "Appears in the order of SRNS (Gen2 & below); SRIS (Gen2 & below); SRNS (Gen3 & above); SRIS (Gen3 & above). It is ok to enable REFCLK Spread Spectrum for this feature."
#string STR_SRIS_LOWER_SKP_OS_GEN_SUPPORT                 #language en-US "LOWER_SKP_OS_GEN_SUPPORT"
#string STR_GEN1                                          #language en-US "Gen1"
#string STR_GEN2                                          #language en-US "Gen2"
#string STR_GEN3                                          #language en-US "Gen3"
#string STR_GEN4                                          #language en-US "Gen4"
#string STR_SRIS_LOWER_SKP_OS_GEN_SUPPORT_HELP            #language en-US "Control LOWER_SKP_OS_GEN_SUPPORT"
#string STR_SRIS_LOWER_SKP_OS_RCV_SUPPORT                 #language en-US "LOWER_SKP_OS_RCV_SUPPORT"
#string STR_SRIS_LOWER_SKP_OS_RCV_SUPPORT_HELP            #language en-US "Control LOWER_SKP_OS_RCV_SUPPORT"
#string STR_SRIS_AUTODETECT                               #language en-US "SRIS Autodetect"
#string STR_SRIS_AUTODETECT_HELP                          #language en-US "Control SRIS Autodetect"
#string STR_SRIS_SKP_INTERVAL_SELLECTION                  #language en-US "SKP Interval Selection Mode"
#string STR_SRIS_SKP_INTERVAL_SELLECTION_HELP             #language en-US "Controls the SKP ordered set interval selection method"
#string STR_SRIS_AUTODETECT_FACTOR                        #language en-US "Autodetect Factor"
#string STR_SRIS_AUTODETECT_FACTOR_HELP                   #language en-US "Controls the Autodetection factor"
#string STR_SRIS_AUTODETECT_FACTOR_1X                     #language en-US "1x"
#string STR_SRIS_AUTODETECT_FACTOR_095X                   #language en-US "0.95x"
#string STR_SRIS_AUTODETECT_FACTOR_09X                    #language en-US "0.9x"
#string STR_SRIS_AUTODETECT_FACTOR_085X                   #language en-US "0.85x"
#string STR_SRIS_SKP_ORDERED_SET_INTERVAL_LOCK            #language en-US "SKP ordered set Interval Lock Mode"
#string STR_SRIS_DYN_SKP_ORDERED_SET_INTERVAL             #language en-US "Dynamic SKP ordered set Interval Mode"
#string STR_SRIS_FAR_END_NOMINAL_EMPTY                    #language en-US "Far End Nominal Empty Mode"

//AMD CPM CXL Range Encryuption
#string STR_CXL_ENCRYPTION_FORM                           #language en-US "CXL Range Encryption"
#string STR_CXL_ENCRYPTION_FORM_HELP                      #language en-US "AMD CXL Range Encryption Setting"
#string STR_CXL_RANGE1                                    #language en-US "Range 1"
#string STR_CXL_RANGE2                                    #language en-US "Range 2"
#string STR_CXL_RANGE3                                    #language en-US "Range 3"
#string STR_CXL_RANGE4                                    #language en-US "Range 4"
#string STR_CXL_RANGE5                                    #language en-US "Range 5"
#string STR_CXL_RANGE6                                    #language en-US "Range 6"
#string STR_CXL_RANGE7                                    #language en-US "Range 7"
#string STR_CXL_RANGE1_MEMBASE                            #language en-US "  Range 1 Memory Base"
#string STR_CXL_RANGE1_MEMLIMIT                           #language en-US "  Range 1 Memory Limit"
#string STR_CXL_RANGE2_MEMBASE                            #language en-US "  Range 2 Memory Base"
#string STR_CXL_RANGE2_MEMLIMIT                           #language en-US "  Range 2 Memory Limit"
#string STR_CXL_RANGE3_MEMBASE                            #language en-US "  Range 3 Memory Base"
#string STR_CXL_RANGE3_MEMLIMIT                           #language en-US "  Range 3 Memory Size"
#string STR_CXL_RANGE4_MEMBASE                            #language en-US "  Range 4 Memory Base"
#string STR_CXL_RANGE4_MEMLIMIT                           #language en-US "  Range 4 Memory Limit"
#string STR_CXL_RANGE5_MEMBASE                            #language en-US "  Range 5 Memory Base"
#string STR_CXL_RANGE5_MEMLIMIT                           #language en-US "  Range 5 Memory Limit"
#string STR_CXL_RANGE6_MEMBASE                            #language en-US "  Range 6 Memory Base"
#string STR_CXL_RANGE6_MEMLIMIT                           #language en-US "  Range 6 Memory Size"
#string STR_CXL_RANGE7_MEMBASE                            #language en-US "  Range 7 Memory Base"
#string STR_CXL_RANGE7_MEMLIMIT                           #language en-US "  Range 7 Memory Size"
#string STR_CXL_RANGE_ENCRYPTED_MEM                       #language en-US "CXL Range Encryption"
#string STR_CXL_RANGE_ENCRYPTED_MEM_HELP                  #language en-US "Select to enter CXL Range Encryption Submenu"
#string STR_CXL_RANGE_ENCRYPTED_MEM_BASE_LIMIT_HELP       #language en-US "Enter memory range base address and limit address"
#string STR_CXL_ENCRYPTION_START_OPERATION                #language en-US "Start CXL Range Encryption"
#string STR_CXL_ENCRYPTION_START_OPERATION_HELP           #language en-US "Start to encrypt all memory ranges"
#string STR_CXL_NULL                                      #language en-US ""

#string STR_HBA                                           #language en-US "HBA"
#string STR_HBA_HELP                                      #language en-US "Enable/Disable HBA for Standard backplane, Do not enable for Full Nvme backplane"

#string STR_AMD_VARIABLE_PROTECTION                       #language en-US "AMD Variable Protection"
#string STR_AMD_VARIABLE_PROTECTION_HELP                  #language en-US "Protect some AMD specific variables for CBS, PBS and AOD. If locked, some utilities like RU that modify variable at runtime do not work."

